In [54]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import display

In [151]:
# Load our data
ptr = pd.read_csv('./data/Zip_PriceToRentRatio_AllHomes.csv')
zillow = pd.read_csv('./data/Zip_Zhvi_Summary_AllHomes.csv')
three_bed_buy = pd.read_csv('./data/Zip_Zhvi_3bedroom.csv')
three_bed_rent = pd.read_csv('./data/Zip_MedianRentalPrice_3Bedroom.csv')

In [61]:
REGION = 60657
print("*****\nPrice to rent")
display(ptr[ptr.RegionName == REGION])
print("*****\nZillow")
display(zillow[zillow.RegionName == REGION])
print("*****\n3 bed buy")
display(three_bed_buy[three_bed_buy.RegionName == REGION])
print("*****\n3 bed rent")
display(three_bed_rent[three_bed_rent.RegionName == REGION])

*****
Price to rent

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,2010-10,2010-11,2010-12,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
1,84654,60657,Chicago,IL,Chicago,Cook,2,13.27,13.2,13.2,...,12.4,12.52,12.68,12.85,12.99,13.07,13.15,13.23,13.17,13.01

*****
Zillow

,Date,RegionID,RegionName,State,Metro,County,City,SizeRank,Zhvi,MoM,QoQ,YoY,5Year,10Year,PeakMonth,PeakQuarter,PeakZHVI,PctFallFromPeak,LastTimeAtCurrZHVI
1,2017-06-30,84654,60657,IL,Chicago,Cook,Chicago,1,329100,0.003966,0.016368,0.036535,0.045942,0.002339,2017-06,2017-Q2,329100,0.0,2017-06

*****
3 bed buy

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
1,84654,60657,Chicago,IL,Chicago,Cook,2,254500.0,255300.0,257700.0,...,553500,556000,557600,559400.0,562300,565200,565800,566700,568900,570600

*****
3 bed rent

,RegionName,City,State,Metro,CountyName,SizeRank,2010-03,2010-04,2010-05,2010-06,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
1,60657,Chicago,IL,Chicago,Cook,2,NaN,NaN,NaN,NaN,...,2600.0,2550.0,2467.0,2595.0,2500.0,2580.0,2695.0,2645.0,2700.0,2700.0

In [161]:
# Select the columns we want
zillow_columns = pd.DataFrame({'RegionName': zillow['RegionName'], 'YOY': zillow['YoY'], '5Year': zillow['5Year'], '10Year': zillow['10Year']})
three_bed_buy_columns = pd.DataFrame({'RegionName': three_bed_buy['RegionName'], 'three_bed_buy': three_bed_buy['2017-06']})
three_bed_rent_columns = pd.DataFrame({'RegionName': three_bed_rent['RegionName'], 'three_bed_rent': three_bed_rent['2017-06']})

In [165]:
# Start a new DF where we'll be saving our data
data = pd.DataFrame({'RegionName': ptr['RegionName'], 'City': ptr['City'], 'State': ptr['State'], 'PTR': ptr['2017-06']})
print(data.shape)
data.head()

(13200, 4)

       City    PTR  RegionName State
0  New York  26.53       10025    NY
1   Chicago  13.01       60657    IL
2   Chicago  14.13       60614    IL
3   El Paso   9.53       79936    TX
4   Chicago  10.53       60640    IL

In [166]:
data = data.merge(zillow_columns, on='RegionName', how='outer')
data = data.merge(three_bed_buy_columns, on='RegionName', how='outer')
data = data.merge(three_bed_rent_columns, on='RegionName', how='outer')
print(data.shape)
data.head()

(13640, 9)

,City,PTR,RegionName,State,10Year,5Year,YOY,three_bed_buy,three_bed_rent
0,New York,26.53,10025,NY,0.056270,0.097906,0.153775,2598800.0,4250.0
1,Chicago,13.01,60657,IL,0.002339,0.045942,0.036535,570600.0,2700.0
2,Chicago,14.13,60614,IL,0.005762,0.051851,0.035127,638200.0,2995.0
3,El Paso,9.53,79936,TX,-0.012443,0.000349,0.019556,110700.0,1000.0
4,Chicago,10.53,60640,IL,-0.013752,0.046476,0.046582,373800.0,2200.0

In [181]:
data.dropna().sort_values('PTR')[data['State'] == 'KY']

/Users/carl/anaconda/lib/python3.5/site-packages/ipykernel/__main__.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  if __name__ == '__main__':

,City,PTR,RegionName,State,10Year,5Year,YOY,three_bed_buy,three_bed_rent
8155,Oak Grove,9.3,42262,KY,0.003511,0.004583,0.025386,89300.0,800.0